yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/spi/inc/rtl_spi.h
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef RTL_SPI_H
#define RTL_SPI_H

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "utils/rtl_utils.h"
#if defined (CONFIG_SOC_SERIES_RTL87X2G)
#include "spi/src/rtl87x2g/rtl_spi_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3E)
#include "spi/src/rtl87x3e/rtl_spi_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3D)
#include "spi/src/rtl87x3d/rtl_spi_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL8762J)
#include "spi/src/rtl87x2j/rtl_spi_def.h"
#endif

/** \defgroup SPI         SPI
  * \brief
  * \{
  */
/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup SPI_Exported_Constants SPI Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    SPI_Clock_Speed SPI Clock Speed
 * \{
 * \ingroup     SPI_Exported_Constants
 */
#define IS_SPI_CLOCK_SPEED(SPEED) (((SPEED) >= 0x01) && \
                                   ((SPEED) <= 40000000)) //!< SPI clock speed is between 1 and 40000000.

/** End of SPI_Clock_Speed
  * \}
  */

/**
 * \defgroup    SPI_Data_Direction SPI Data Direction
 * \{
 * \ingroup     SPI_Exported_Constants
 */
typedef enum
{
    SPI_Direction_FullDuplex = 0x00, //!< Data can be transmitted and received at the same time.
    SPI_Direction_TxOnly     = 0x01, //!< Data can only be transmitted at a time.
    SPI_Direction_RxOnly     = 0x02, //!< Data can only be received at a time.
    SPI_Direction_EEPROM     = 0x03, //!< Send data first to read target numbers of data.
} SPIDataDirection_TypeDef;

#define IS_SPI_DIRECTION_MODE(MODE) (((MODE) == SPI_Direction_FullDuplex) || \
                                     ((MODE) == SPI_Direction_RxOnly) || \
                                     ((MODE) == SPI_Direction_TxOnly) || \
                                     ((MODE) == SPI_Direction_EEPROM)) //!< Check if the input parameter is valid.

/** End of SPI_Data_Direction
  * \}
  */

/**
 * \defgroup    SPI_Data_Size SPI Data Size
 * \{
 * \ingroup     SPI_Exported_Constants
 */
typedef enum
{
    SPI_DataSize_4b  = 0x03,     //!< The data frame size is programmed to 4bits.
    SPI_DataSize_5b  = 0x04,     //!< The data frame size is programmed to 5bits.
    SPI_DataSize_6b  = 0x05,     //!< The data frame size is programmed to 6bits.
    SPI_DataSize_7b  = 0x06,     //!< The data frame size is programmed to 7bits.
    SPI_DataSize_8b  = 0x07,     //!< The data frame size is programmed to 8bits.
    SPI_DataSize_9b  = 0x08,     //!< The data frame size is programmed to 9bits.
    SPI_DataSize_10b = 0x09,     //!< The data frame size is programmed to 10bits.
    SPI_DataSize_11b = 0x0a,     //!< The data frame size is programmed to 11bits.
    SPI_DataSize_12b = 0x0b,     //!< The data frame size is programmed to 12bits.
    SPI_DataSize_13b = 0x0c,     //!< The data frame size is programmed to 13bits.
    SPI_DataSize_14b = 0x0d,     //!< The data frame size is programmed to 14bits.
    SPI_DataSize_15b = 0x0e,     //!< The data frame size is programmed to 15bits.
    SPI_DataSize_16b = 0x0f,     //!< The data frame size is programmed to 16bits.
    SPI_DataSize_17b = 0x10,     //!< The data frame size is programmed to 17bits.
    SPI_DataSize_18b = 0x11,     //!< The data frame size is programmed to 18bits.
    SPI_DataSize_19b = 0x12,     //!< The data frame size is programmed to 19bits.
    SPI_DataSize_20b = 0x13,     //!< The data frame size is programmed to 20bits.
    SPI_DataSize_21b = 0x14,     //!< The data frame size is programmed to 21bits.
    SPI_DataSize_22b = 0x15,     //!< The data frame size is programmed to 22bits.
    SPI_DataSize_23b = 0x16,     //!< The data frame size is programmed to 23bits.
    SPI_DataSize_24b = 0x17,     //!< The data frame size is programmed to 24bits.
    SPI_DataSize_25b = 0x18,     //!< The data frame size is programmed to 25bits.
    SPI_DataSize_26b = 0x19,     //!< The data frame size is programmed to 26bits.
    SPI_DataSize_27b = 0x1A,     //!< The data frame size is programmed to 27bits.
    SPI_DataSize_28b = 0x1B,     //!< The data frame size is programmed to 28bits.
    SPI_DataSize_29b = 0x1C,     //!< The data frame size is programmed to 29bits.
    SPI_DataSize_30b = 0x1D,     //!< The data frame size is programmed to 30bits.
    SPI_DataSize_31b = 0x1E,     //!< The data frame size is programmed to 31bits.
    SPI_DataSize_32b = 0x1F,     //!< The data frame size is programmed to 32bits.
} SPIDataSize_TypeDef;

#define IS_SPI_DATASIZE(DATASIZE) (((DATASIZE) == SPI_DataSize_4b)  || \
                                   ((DATASIZE) == SPI_DataSize_5b)  || \
                                   ((DATASIZE) == SPI_DataSize_6b)  || \
                                   ((DATASIZE) == SPI_DataSize_7b)  || \
                                   ((DATASIZE) == SPI_DataSize_8b)  || \
                                   ((DATASIZE) == SPI_DataSize_9b)  || \
                                   ((DATASIZE) == SPI_DataSize_10b) || \
                                   ((DATASIZE) == SPI_DataSize_11b) || \
                                   ((DATASIZE) == SPI_DataSize_12b) || \
                                   ((DATASIZE) == SPI_DataSize_13b) || \
                                   ((DATASIZE) == SPI_DataSize_14b) || \
                                   ((DATASIZE) == SPI_DataSize_15b) || \
                                   ((DATASIZE) == SPI_DataSize_16b) || \
                                   ((DATASIZE) == SPI_DataSize_17b) || \
                                   ((DATASIZE) == SPI_DataSize_18b) || \
                                   ((DATASIZE) == SPI_DataSize_19b) || \
                                   ((DATASIZE) == SPI_DataSize_20b) || \
                                   ((DATASIZE) == SPI_DataSize_21b) || \
                                   ((DATASIZE) == SPI_DataSize_22b) || \
                                   ((DATASIZE) == SPI_DataSize_23b) || \
                                   ((DATASIZE) == SPI_DataSize_24b) || \
                                   ((DATASIZE) == SPI_DataSize_25b) || \
                                   ((DATASIZE) == SPI_DataSize_26b) || \
                                   ((DATASIZE) == SPI_DataSize_27b) || \
                                   ((DATASIZE) == SPI_DataSize_28b) || \
                                   ((DATASIZE) == SPI_DataSize_29b) || \
                                   ((DATASIZE) == SPI_DataSize_30b) || \
                                   ((DATASIZE) == SPI_DataSize_31b) || \
                                   ((DATASIZE) == SPI_DataSize_32b)) //!< Check if the input parameter is valid.

/** End of SPI_Data_Size
  * \}
  */

/**
 * \defgroup    SPI_Clock_Polarity SPI Clock Polarity
 * \{
 * \ingroup     SPI_Exported_Constants
 */
typedef enum
{
    SPI_CPOL_Low = 0x00,  //!< Inactive state of serial clock is low.
    SPI_CPOL_High = 0x01, //!< Inactive state of serial clock is high.
} SPIClockPolarity_TypeDef;

#define IS_SPI_CPOL(CPOL) (((CPOL) == SPI_CPOL_Low) || \
                           ((CPOL) == SPI_CPOL_High)) //!< Check if the input parameter is valid.

/** End of SPI_Clock_Polarity
  * \}
  */

/**
 * \defgroup    SPI_Clock_Phase SPI Clock Phase
 * \{
 * \ingroup     SPI_Exported_Constants
 */
typedef enum
{
    SPI_CPHA_1Edge = 0x00, //!< Serial clock toggles in middle of first data bit.
    SPI_CPHA_2Edge = 0x01, //!< Serial clock toggles at start of first data bit.
} SPIClockPhase_TypeDef;

#define IS_SPI_CPHA(CPHA) (((CPHA) == SPI_CPHA_1Edge) || \
                           ((CPHA) == SPI_CPHA_2Edge)) //!< Check if the input parameter is valid.

/** End of SPI_Clock_Phase
  * \}
  */

/**
 * \defgroup    SPI_BaudRate_Prescaler_Value SPI BaudRate Prescaler Value
 * \{
 * \ingroup     SPI_Exported_Constants
 */

#define IS_SPI_BAUDRATE_PRESCALER(PRESCALER) ((PRESCALER) <= 0xFFFF) //!< Check if the input parameter is valid.

/** End of SPI_BaudRate_Prescaler_Value
  * \}
  */

/**
 * \defgroup    SPI_Frame_Format SPI Frame Format
 * \{
 * \ingroup     SPI_Exported_Constants
 */
typedef enum
{
    SPI_Frame_Motorola      = 0x00, //!< Standard SPI frame format.
    SPI_Frame_TI_SSP        = 0x01, //!< Texas instruments SSP frame format.
    SPI_Frame_NS_MICROWIRE  = 0x02, //!< National microwire frame format.
    SPI_Frame_Reserve       = 0x03, //!< Reserved value.
} SPIFrameFormat_TypeDef;

#define IS_SPI_FRAME_FORMAT(FRAME) (((FRAME) == SPI_Frame_Motorola) || \
                                    ((FRAME) == SPI_Frame_TI_SSP) || \
                                    ((FRAME) == SPI_Frame_NS_MICROWIRE) || \
                                    ((FRAME) == SPI_Frame_Reserve)) //!< Check if the input parameter is valid.

/** End of SPI_Frame_Format
  * \}
  */

/**
 * \defgroup    SPI_GDMA_Transfer_Request SPI GDMA Transfer Request
 * \{
 * \ingroup     SPI_Exported_Constants
 */
typedef enum
{
    SPI_GDMAReq_Rx = 0x01, //!< RX buffer GDMA transfer request.
    SPI_GDMAReq_Tx = 0x02, //!< TX buffer GDMA transfer request.
} SPIGdmaTransferRequests_TypeDef;

#define IS_SPI_GDMAREQ(GDMAREQ) (((GDMAREQ)  == SPI_GDMAReq_Rx) || \
                                 ((GDMAREQ) == SPI_GDMAReq_Tx)) //!< Check if the input parameter is valid.

/** End of SPI_GDMA_Transfer_Request
  * \}
  */

/**
 * \defgroup    SPI_Flags SPI Flags
 * \{
 * \ingroup     SPI_Exported_Constants
 */
#define SPI_FLAG_BUSY                   BIT0  /**< SPI Busy flag. Set if it is actively transferring data. Reset if it is idle or disabled. */
#define SPI_FLAG_TFNF                   BIT1  /**< Transmit FIFO not full flag. Set if transmit FIFO is not full. */
#define SPI_FLAG_TFE                    BIT2  /**< Transmit FIFO empty flag. Set if transmit FIFO is empty. */
#define SPI_FLAG_RFNE                   BIT3  /**< Receive FIFO not empty flag. Set if receive FIFO is not empty. */
#define SPI_FLAG_RFF                    BIT4  /**< Receive FIFO full flag. Set if the receive FIFO is completely full. */
#define SPI_FLAG_TXE                    BIT5  /**< Transmission error flag. Set if the transmit FIFO is empty when a transfer is started in slave mode. */
#define SPI_FLAG_DCOL                   BIT6  /**< Data collision error flag. Set if it is actively transmitting in master mode when another master selects this device as a slave. */
#if (SPI_SUPPORT_WRAP_MODE == 1)
#define SPI_FLAG_WRAP_CS_EN             BIT8
#define SPI_FLAG_WRAP_TFNF              BIT9
#define SPI_FLAG_WRAP_TFE               BIT10
#endif

#if (SPI_SUPPORT_WRAP_MODE == 1)
#define IS_SPI_GET_FLAG(FLAG)   (((FLAG) == SPI_FLAG_DCOL) || \
                                 ((FLAG) == SPI_FLAG_TXE) || \
                                 ((FLAG) == SPI_FLAG_RFF) || \
                                 ((FLAG) == SPI_FLAG_RFNE) || \
                                 ((FLAG) == SPI_FLAG_TFE) || \
                                 ((FLAG) == SPI_FLAG_TFNF) || \
                                 ((FLAG) == SPI_FLAG_BUSY) || \
                                 ((FLAG) == SPI_FLAG_WRAP_CS_EN) || \
                                 ((FLAG) == SPI_FLAG_WRAP_TFNF) || \
                                 ((FLAG) == SPI_FLAG_WRAP_TFE)) //!< Check if the input parameter is valid.
#else
#define IS_SPI_GET_FLAG(FLAG)   (((FLAG) == SPI_FLAG_DCOL) || \
                                 ((FLAG) == SPI_FLAG_TXE) || \
                                 ((FLAG) == SPI_FLAG_RFF) || \
                                 ((FLAG) == SPI_FLAG_RFNE) || \
                                 ((FLAG) == SPI_FLAG_TFE) || \
                                 ((FLAG) == SPI_FLAG_TFNF) || \
                                 ((FLAG) == SPI_FLAG_BUSY)) //!< Check if the input parameter is valid.
#endif

/** End of SPI_Flags
  * \}
  */

/**
 * \defgroup    SPI_Interrupt SPI Interrupt
 * \{
 * \ingroup     SPI_Exported_Constants
 */
#define SPI_INT_TXE                    BIT0 //!< Transmit FIFO empty interrupt.
#define SPI_INT_TXO                    BIT1 //!< Transmit FIFO overflow interrupt.
#define SPI_INT_RXU                    BIT2 //!< Receive FIFO underflow interrupt.
#define SPI_INT_RXO                    BIT3 //!< Receive FIFO overflow interrupt.
#define SPI_INT_RXF                    BIT4 //!< Receive FIFO full interrupt.
#define SPI_INT_MST                    BIT5 //!< Multi-Master contention interrupt. (master only)
#define SPI_INT_FAE                    BIT5 //!< The data of slave rx does not match DFS. (slave only)
#define SPI_INT_TUF                    BIT6 //!< Transmit FIFO underflow interrupt. (slave only)
#define SPI_INT_RIG                    BIT7 //!< CS rising edge detect interrupt. (slave only)
#if (SPI_SUPPORT_WRAP_MODE == 1)
#define SPI_INT_WRAP_TXE               BIT8
#define SPI_INT_WRAP_TXO               BIT9
#define SPI_INT_WRAP_TXD               BIT10
#endif

#if (SPI_SUPPORT_WRAP_MODE == 1)
#define IS_SPI_CONFIG_IT(IT) (((IT) == SPI_INT_TXE) || \
                              ((IT) == SPI_INT_TXO) || \
                              ((IT) == SPI_INT_RXU) || \
                              ((IT) == SPI_INT_RXO) || \
                              ((IT) == SPI_INT_RXF) || \
                              ((IT) == SPI_INT_MST) || \
                              ((IT) == SPI_INT_FAE) || \
                              ((IT) == SPI_INT_TUF) || \
                              ((IT) == SPI_INT_RIG) || \
                              ((IT) == SPI_INT_WRAP_TXE) || \
                              ((IT) == SPI_INT_WRAP_TXO) || \
                              ((IT) == SPI_INT_WRAP_TXD)) //!< Check if the input parameter is valid.
#else
#define IS_SPI_CONFIG_IT(IT) (((IT) == SPI_INT_TXE) || \
                              ((IT) == SPI_INT_TXO) || \
                              ((IT) == SPI_INT_RXU) || \
                              ((IT) == SPI_INT_RXO) || \
                              ((IT) == SPI_INT_RXF) || \
                              ((IT) == SPI_INT_MST) || \
                              ((IT) == SPI_INT_FAE) || \
                              ((IT) == SPI_INT_TUF) || \
                              ((IT) == SPI_INT_RIG) ) //!< Check if the input parameter is valid.
#endif

