yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/spi/inc/rtl_spi.h
/** End of SPI_Interrupt
  * \}
  */

#if (SPI0_SUPPORT_MASTER_SLAVE == 1)

/**
 * \defgroup    SPI_mode SPI Mode
 * \{
 * \ingroup     SPI_Exported_Constants
 */
typedef enum
{
    SPI_Mode_Master = ((uint16_t)0x0104), //!< SPI device operating mode as master.
    SPI_Mode_Slave  = ((uint16_t)0x0000)  //!< SPI device operating mode as slave.
} SPIMode_Typedef;

#define IS_SPI_MODE(MODE) (((MODE) == SPI_Mode_Master) || \
                           ((MODE) == SPI_Mode_Slave)) //!< Check if the input parameter is valid.

/** End of SPI_mode
  * \}
  */
#endif

#if (SPI_SUPPORT_RAP_FUNCTION == 1)
/**
 * \defgroup    SPI_TaskEvent SPI Task Event
 * \{
 * \ingroup     SPI_Exported_Constants
 */
typedef enum
{
    SPI_TASK_START  = 0,
    SPI_EVENT_START = 1,
    SPI_EVENT_END   = 2,
} SPITaskEvent_TypeDef;

/** End of SPI_TaskEvent
  * \}
  */
#endif

/** End of SPI_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         Types
 *============================================================================*/
/** \defgroup SPI_Exported_Types SPI Exported Types
  * \brief
  * \{
  */

/**
 * \brief       SPI init structure definition.
 *
 * \ingroup     SPI_Exported_Types
 */
typedef struct
{
    SPIDataDirection_TypeDef
    SPI_Direction;    /*!< Specify the SPI unidirectional or bidirectional data mode.
                                                    This parameter can be a value of \ref SPI_Data_Direction. */
#if (SPI_SUPPORT_WRAP_MODE == 1)
    uint32_t SPI_TXNDF;                        /*!< Specify the trigger condition in TxOnly or FullDuplex mode.
                                                    This parameter should be the value of the length of read data,
                                                    from 1 to 65536. */

    FunctionalState SPI_CSHighActiveEn;        /*!< Specify whether to enable CS high active.
                                                    This parameter can be a value of ENABLE or DISABLE. */

    FunctionalState
    SPI_WrapModeEn;            /*!< Specify the TX waper mode (TX NDF) enable. Only SPI1 have txndf mode.
                                                    ENABLE: Hardware won't automatically pull SPI_CSN high when TX FIFO is empty.
                                                    DISABLE: SPI_CSN pull high when TX data number = SPI_TXNDF+1. */

    FunctionalState SPI_WrapModeDmaEn;         /*!< Specify the TX waper mode(TX NDF) DMA enable.
                                                    This parameter can be a value of ENABLE or DISABLE. */

    uint8_t  SPI_TxNdfWaterlevel;              /*!< Specify the TX NDF DMA tx water level max number is 63. */
#endif

    uint32_t SPI_RXNDF;                        /*!< Specify the trigger condition in RxOnly or EEPROM mode.
                                                    This parameter should be a value of the length of read data,
                                                    ranging from 1 to 65536. */

#if (SPI0_SUPPORT_MASTER_SLAVE == 1)
    SPIMode_Typedef SPI_Mode;                  /*!< Specify the SPI Mode.
                                                    This parameter can be a value of \ref SPI_mode. */
#endif

    SPIDataSize_TypeDef SPI_DataSize;          /*!< Specify the SPI data size.
                                                    This parameter can be a value of \ref SPI_Data_Size. */

    SPIClockPolarity_TypeDef SPI_CPOL;         /*!< Specify the serial clock steady state.
                                                    This parameter can be a value of \ref SPI_Clock_Polarity. */

    SPIClockPhase_TypeDef SPI_CPHA;            /*!< Specify clock active edge for bit capture.
                                                    This parameter can be a value of \ref SPI_Clock_Phase. */

    SPIFrameFormat_TypeDef
    SPI_FrameFormat;                           /*!< Specify which serial protocol transfers the data.
                                                    This parameter can be a value of \ref SPI_Frame_Format. */

    uint32_t SPI_BaudRatePrescaler;            /*!< Specify the divider of SPI clock. SPI Clock Speed = clk source/SPI_BaudRatePrescaler.
                                                    This parameter can be any even value between 2 and 65534.
                                                    This parameter can also refer to the listed values of \ref SPI_BaudRate_Prescaler_Value. */

#if (SPI_SUPPORT_SWAP == 1)
    FunctionalState SPI_SwapTxBitEn;           /*!< Specify whether to swap SPI Tx data bit.
                                                    This parameter can be a value of ENABLE or DISABLE. */

    FunctionalState SPI_SwapRxBitEn;           /*!< Specify whether to swap SPI Rx data bit.
                                                    This parameter can be a value of ENABLE or DISABLE. */

    FunctionalState SPI_SwapTxByteEn;          /*!< Specify whether to swap SPI Tx data byte.
                                                    This parameter can be a value of ENABLE or DISABLE. */

    FunctionalState SPI_SwapRxByteEn;          /*!< Specify whether to swap SPI Rx data byte.
                                                    This parameter can be a value of ENABLE or DISABLE. */
#endif

    FunctionalState SPI_ToggleEn;              /*!< Specify whether to toggle when transfer done.
                                                    This parameter can be a value of ENABLE or DISABLE. */

    uint32_t SPI_TxThresholdLevel;             /*!< Specify the transmit FIFO Threshold.
                                                    This parameter can be a value less than 64.*/

    uint32_t SPI_RxThresholdLevel;             /*!< Specify the receive FIFO Threshold.
                                                    This parameter can be a value less than 64.*/

    FunctionalState SPI_TxDmaEn;               /*!< Specify the Tx dma mode.
                                                    This parameter can be a value of ENABLE or DISABLE. */

    FunctionalState SPI_RxDmaEn;               /*!< Specify the Rx dma mode.
                                                    This parameter can be a value of ENABLE or DISABLE. */

    uint8_t SPI_TxWaterlevel;                  /*!< Specify the DMA Tx water level.
                                                    The best value is SPI fifo depth - Tx GDMA MSize. */

    uint8_t SPI_RxWaterlevel;                  /*!< Specify the DMA Rx water level.
                                                    The best value is SPI Rx GDMA MSize. */
} SPI_InitTypeDef;

