yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/spi/inc/rtl_spi.h
/** End of SPI_Exported_Types
  * \}
  */

/*============================================================================*
 *                         Functions
 *============================================================================*/
/** \defgroup SPI_Exported_Functions SPI Exported Functions
  * \brief
  * \{
  */

/**
 * \brief   Deinitialize the SPIx peripheral registers to their default reset values.
 *
 * \param[in] SPIx  Select the SPI peripheral. Refer to \ref SPI_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *     SPI_DeInit(SPI0);
 * }
 * \endcode
 */
void SPI_DeInit(SPI_TypeDef *SPIx);

/**
 * \brief   Initialize the SPIx peripheral according to the specified
 *          parameters in the SPI_InitStruct.
 *
 * \param[in] SPIx            Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] SPI_InitStruct  Pointer to a SPI_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_SPI0, APBPeriph_SPI0_CLOCK, ENABLE);

 *     SPI_InitTypeDef  SPI_InitStruct;
 *     SPI_StructInit(&SPI_InitStruct);
 *
 *     SPI_InitStruct.SPI_Direction   = SPI_Direction_EEPROM;
 *     SPI_InitStruct.SPI_DataSize    = SPI_DataSize_8b;
 *     SPI_InitStruct.SPI_CPOL        = SPI_CPOL_High;
 *     SPI_InitStruct.SPI_CPHA        = SPI_CPHA_2Edge;
 *     SPI_InitStruct.SPI_BaudRatePrescaler  = 100;
 *     SPI_InitStruct.SPI_RxThresholdLevel  = 1 - 1;
 *     SPI_InitStruct.SPI_NDF               = 1 - 1;
 *     SPI_InitStruct.SPI_FrameFormat = SPI_Frame_Motorola;
 *
 *     SPI_Init(SPI0, &SPI_InitStruct);
 * }
 * \endcode
 */
void SPI_Init(SPI_TypeDef *SPIx, SPI_InitTypeDef *SPI_InitStruct);

/**
 * \brief  Fill each SPI_InitStruct member with its default value.
 *
 * \note   The default settings for the SPI_InitStruct member are shown in the following table:
 *         | SPI_InitStruct member  | Default value                  |
 *         |:----------------------:|:------------------------------:|
 *         | SPI_Direction          | \ref SPI_Direction_FullDuplex  |
 *         | SPI_RXNDF              | 1                              |
 *         | SPI_DataSize           | \ref SPI_DataSize_8b           |
 *         | SPI_CPOL               | \ref SPI_CPOL_High             |
 *         | SPI_CPHA               | \ref SPI_CPHA_2Edge            |
 *         | SPI_FrameFormat        | \ref SPI_Frame_Motorola        |
 *         | SPI_BaudRatePrescaler  | 128                            |
 *         | SPI_ToggleEn           | DISABLE                        |
 *         | SPI_TxThresholdLevel   | 1                              |
 *         | SPI_RxThresholdLevel   | 0                              |
 *         | SPI_TxDmaEn            | DISABLE                        |
 *         | SPI_RxDmaEn            | DISABLE                        |
 *         | SPI_TxWaterlevel       | SPI_TX_FIFO_SIZE - 1           |
 *         | SPI_RxWaterlevel       | 1                              |
 *
 * \param[in] SPI_InitStruct  Pointer to a SPI_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *
 *     RCC_PeriphClockCmd(APBPeriph_SPI0, APBPeriph_SPI0_CLOCK, ENABLE);

 *     SPI_InitTypeDef  SPI_InitStruct;
 *     SPI_StructInit(&SPI_InitStruct);
 *
 *     SPI_InitStruct.SPI_Direction   = SPI_Direction_EEPROM;
 *     SPI_InitStruct.SPI_DataSize    = SPI_DataSize_8b;
 *     SPI_InitStruct.SPI_CPOL        = SPI_CPOL_High;
 *     SPI_InitStruct.SPI_CPHA        = SPI_CPHA_2Edge;
 *     SPI_InitStruct.SPI_BaudRatePrescaler  = 100;
 *     SPI_InitStruct.SPI_RxThresholdLevel  = 1 - 1;
 *     SPI_InitStruct.SPI_NDF               = 1 - 1;
 *     SPI_InitStruct.SPI_FrameFormat = SPI_Frame_Motorola;
 *
 *     SPI_Init(SPI0, &SPI_InitStruct);
 * }
 * \endcode
 */
void SPI_StructInit(SPI_InitTypeDef *SPI_InitStruct);

/**
 * \brief  Enable or disable the selected SPI peripheral.
 *
 * \param[in] SPIx      Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] NewState  New state of the SPIx peripheral.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the selected SPI peripheral.
 *                      - DISABLE: Disable the selected SPI peripheral.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *
 *     RCC_PeriphClockCmd(APBPeriph_SPI0, APBPeriph_SPI0_CLOCK, ENABLE);
 *
 *     SPI_InitTypeDef  SPI_InitStruct;
 *     SPI_StructInit(&SPI_InitStruct);
 *
 *     SPI_InitStruct.SPI_Direction   = SPI_Direction_EEPROM;
 *     SPI_InitStruct.SPI_DataSize    = SPI_DataSize_8b;
 *     SPI_InitStruct.SPI_CPOL        = SPI_CPOL_High;
 *     SPI_InitStruct.SPI_CPHA        = SPI_CPHA_2Edge;
 *     SPI_InitStruct.SPI_BaudRatePrescaler  = 100;
 *     SPI_InitStruct.SPI_RxThresholdLevel  = 1 - 1;
 *     SPI_InitStruct.SPI_NDF               = 1 - 1;
 *     SPI_InitStruct.SPI_FrameFormat = SPI_Frame_Motorola;
 *
 *     SPI_Init(SPI0, &SPI_InitStruct);
 *     SPI_Cmd(SPI0, ENABLE);
 * }
 * \endcode
 */
void SPI_Cmd(SPI_TypeDef *SPIx, FunctionalState NewState);

/**
 * \brief  Transmit a number of bytes through the SPIx peripheral.
 *
 * \param[in] SPIx  Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] pBuf  Bytes to be transmitted.
 * \param[in] len   Byte length to be transmitted.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint8_t data_buf[] = {0x01,0x02,0x03};
 *     SPI_SendBuffer(SPI0, data_buf, sizeof(data_buf));
 * }
 * \endcode
 */
void SPI_SendBuffer(SPI_TypeDef *SPIx, uint8_t *pBuf, uint16_t len);

/**
 * \brief  Transmit a number of halfword through the SPIx peripheral.
 *
 * \param[in] SPIx  Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] pBuf  Halfwords to be transmitted.
 * \param[in] len   Halfwords length to be transmitted.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint16_t data_buf[] = {0x0102,0x0203,0x0304};
 *     SPI_SendHalfWord(SPI0, data_buf, sizeof(data_buf)/sizeof(uint16_t));
 * }
 * \endcode
  */
void SPI_SendHalfWord(SPI_TypeDef *SPIx, uint16_t *pBuf, uint16_t len);

/**
 * \brief  Transmit a number of words through the SPIx peripheral.
 *
 * \param[in] SPIx  Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] pBuf  Words to be transmitted.
 * \param[in] len   Word length to be transmitted.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint32_t data_buf[] = {0x01020304,0x02030405,0x03040506};
 *     SPI_SendWord(SPI0, data_buf, sizeof(data_buf)/sizeof(uint32_t));
 * }
 * \endcode
 */
void SPI_SendWord(SPI_TypeDef *SPIx, uint32_t *pBuf, uint16_t len);

/**
 * \brief  Enable or disable the specified SPI interrupt source.
 *
 * \param[in] SPIx      Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] SPI_IT    Specify the SPI interrupt source to be enabled or disabled.
 *                      This parameter can be one of the following values, refer to \ref SPI_Interrupt.
 *                      \arg SPI_INT_TXE: Transmit FIFO empty interrupt.
 *                      \arg SPI_INT_TXO: Transmit FIFO overflow interrupt.
 *                      \arg SPI_INT_RXU: Receive FIFO underflow interrupt.
 *                      \arg SPI_INT_RXO: Receive FIFO overflow interrupt.
 *                      \arg SPI_INT_RXF: Receive FIFO full interrupt.
 *                      \arg SPI_INT_MST: Multi-Master Contention Interrupt.
 *                      \arg SPI_INT_FAE: TX Frame Alignment interrupt.
 *                      \arg SPI_INT_TUF: Transmit FIFO underflow interrupt.
 *                      \arg SPI_INT_RIG: Rising edge detect interrupt.
 * \param[in] NewState  New state of the specified SPI interrupt source.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the specified SPI interrupt source.
 *                      - DISABLE: Disable the specified SPI interrupt source.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_INTConfig(SPI0, SPI_INT_RXF, ENABLE);
 * }
 * \endcode
 */
void SPI_INTConfig(SPI_TypeDef *SPIx, uint16_t SPI_IT, FunctionalState NewState);

/**
 * \brief  Clear the specified SPI interrupt pending bit.
 *
 * \param[in] SPIx    Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] SPI_IT  Specify the SPI interrupt to clear.
 *                    This parameter can be one of the following values, refer to \ref SPI_Interrupt.
 *                    - SPI_INT_TXO: Transmit FIFO Overflow Interrupt.
 *                    - SPI_INT_RXO: Receive FIFO Overflow Interrupt.
 *                    - SPI_INT_RXU: Receive FIFO Underflow Interrupt.
 *                    - SPI_INT_MST: Multi-Master Contention Interrupt.
 *                    - SPI_INT_FAE: TX Frame Alignment Interrupt.
 *                    - SPI_INT_TUF: Transmit FIFO Underflow Interrupt.
 *                    - SPI_INT_RIG: Rising edge detect Interrupt.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_ClearINTPendingBit(SPI0, SPI_INT_RXF);
 * }
 * \endcode
 */
void SPI_ClearINTPendingBit(SPI_TypeDef *SPIx, uint16_t SPI_IT);

/**
 * \brief  Transmit a data through the SPIx peripheral.
 *
 * \param[in] SPIx  Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] Data  Data to be transmitted.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint32_t data = 0x01020304;
 *     SPI_SendData(SPI0, data);
 * }
 * \endcode
 */
void SPI_SendData(SPI_TypeDef *SPIx, uint32_t Data);

/**
 * \brief   Receive data by the SPI peripheral.
 *
 * \param[in] SPIx  Select the SPI peripheral. Refer to \ref SPI_Declaration.
 *
 * \return  The most recent received data.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint32_t data = SPI_ReceiveData(SPI0);
 * }
 * \endcode
 */
uint32_t SPI_ReceiveData(SPI_TypeDef *SPIx);

/**
 * \brief   Get data length in Tx FIFO through the SPIx peripheral.
 *
 * \param[in] SPIx  Select the SPI peripheral. Refer to \ref SPI_Declaration.
 *
 * \return  Data length in Tx FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint8_t data_len = SPI_GetTxFIFOLen(SPI0);
 * }
 * \endcode
 */
uint8_t SPI_GetTxFIFOLen(SPI_TypeDef *SPIx);

/**
 * \brief   Get data length in Rx FIFO through the SPIx peripheral.
 *
 * \param[in] SPIx  Select the SPI peripheral. Refer to \ref SPI_Declaration.
 *
 * \return  Data length in Rx FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint8_t data_len = SPI_GetRxFIFOLen(SPI0);
 * }
 * \endcode
 */
uint8_t SPI_GetRxFIFOLen(SPI_TypeDef *SPIx);

/**
 * \brief   Change SPI direction mode.
 *
 * \param[in] SPIx  Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] dir   Value of direction mode.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_ChangeDirection(SPI0, SPI_Direction_EEPROM);
 * }
 * \endcode
 */
void SPI_ChangeDirection(SPI_TypeDef *SPIx, uint16_t dir);

/**
 * \brief   Set read Data length only in EEPROM mode through the SPIx peripheral,which
            enables you to receive up to 64 KB of data in a continuous transfer.
 *
 * \param[in] SPIx  Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] len   Length of read data which can be 1 to 65536.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_SetReadLen(SPI0, 100);
 * }
 * \endcode
 */
void SPI_SetReadLen(SPI_TypeDef *SPIx, uint16_t len);

/**
 * \brief   Set cs number through the SPIx peripheral.
 *
 * \param[in] SPIx    Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] number  Number can be 0 to 2.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_SetCSNumber(SPI1, 1);
 * }
 * \endcode
 */
void SPI_SetCSNumber(SPI_TypeDef *SPIx, uint8_t number);

/**
 * \brief  Get the specified SPI interrupt status.
 *
 * \param[in] SPIx    Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] SPI_IT  Specify the SPI interrupt to check.
 *                    This parameter can be one of the following values, refer to \ref SPI_Interrupt.
 *                    \arg SPI_INT_MST: Multi-Master Contention Interrupt.
 *                    \arg SPI_INT_FAE: TX Frame Alignment Interrupt.
 *                    \arg SPI_INT_RXF: Receive FIFO Full Interrupt.
 *                    \arg SPI_INT_RXO: Receive FIFO Overflow Interrupt.
 *                    \arg SPI_INT_RXU: Receive FIFO Underflow Interrupt.
 *                    \arg SPI_INT_TXO: Transmit FIFO Overflow Interrupt .
 *                    \arg SPI_INT_TXE: Transmit FIFO Empty Interrupt.
 *                    \arg SPI_INT_WRAP_TXE: TX NDF mode FIFO Transmit FIFO Empty Interrupt.
 *                    \arg SPI_INT_WRAP_TXO: TX NDF mode FIFO Overflow Interrupt.
 *                    \arg SPI_INT_WRAP_TXD: TX NDF mode transmit done Interrupt.
 *
 * \return  The status of the SPI interrupt.
 *          - SET: The SPI interrupt status has been set.
 *          - RESET: The SPI interrupt status has been reset.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     ITStatus int_status = SPI_GetINTStatus(SPI0, SPI_INT_RXF);
 * }
 * \endcode
 */
ITStatus SPI_GetINTStatus(SPI_TypeDef *SPIx, uint32_t SPI_IT);

/**
 * \brief  Get the specified SPI flag status.
 *
 * \param[in] SPIx      Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] SPI_FLAG  Specify the SPI flag to check.
 *                      This parameter can be one of the following values, refer to \ref SPI_Flags.
 *                      \arg SPI_FLAG_DCOL: Data Collision Error flag.Set if it is actively transmitting in master mode when another master selects this device as a slave.
 *                      \arg SPI_FLAG_TXE: Transmission error flag.Set if the transmit FIFO is empty when a transfer is started in slave mode.
 *                      \arg SPI_FLAG_RFF: Receive FIFO full flag. Set if the receive FIFO is completely full.
 *                      \arg SPI_FLAG_RFNE: Receive FIFO Not Empty flag.Set if receive FIFO is not empty.
 *                      \arg SPI_FLAG_TFE: Transmit FIFO Empty flag.Set if transmit FIFO is empty.
 *                      \arg SPI_FLAG_TFNF: Transmit FIFO Not Full flag.Set if transmit FIFO is not full.
 *                      \arg SPI_FLAG_BUSY: SPI Busy flag.Set if it is actively transferring data.reset if it is idle or disabled.
 *                      \arg SPI_FLAG_TXNDF_BUSY: TX NDF mode Busy flag.
 *                      \arg SPI_FLAG_TXNDF_TFNF: TX NDF mode FIFO Not Full flag.
 *                      \arg SPI_FLAG_TXNDF_TFE: TX NDF mode FIFO Empty flag.
 *
 * \return  The status of SPI flag.
 *          - SET: The SPI flag has been set.
 *          - RESET: The SPI flag has been reset.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     FlagStatus flag_status = SPI_GetFlagState(SPI0, SPI_FLAG_TXE);
 *
 * }
 * \endcode
 */
FlagStatus SPI_GetFlagState(SPI_TypeDef *SPIx, uint16_t SPI_FLAG);

/**
 * \brief   Enable or disable the SPIx GDMA interface.
 *
 * \param[in] SPIx         Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] SPI_GDMAReq  Specify the SPI GDMA transfer request to be enabled or disabled.
 *                         This parameter can be one of the following values:
 *                         \arg SPI_GDMAReq_Tx: Tx buffer DMA transfer request.
 *                         \arg SPI_GDMAReq_Rx: Rx buffer DMA transfer request.
 * \param[in] NewState     New state of the selected SPI GDMA transfer request.
 *                         This parameter can be one of the following values:
 *                         - ENABLE: Enable the SPIx GDMA interface.
 *                         - DISABLE: Disable the SPIx GDMA interface.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_GDMACmd(SPI0, SPI_GDMAReq_Tx, ENABLE);
 * }
 * \endcode
 */
void SPI_GDMACmd(SPI_TypeDef *SPIx, SPIGdmaTransferRequests_TypeDef SPI_GDMAReq,
                 FunctionalState NewState);

/**
 * \brief  Change SPI speed daynamically.
 *
 * \param[in] SPIx       Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] precalser  Value of prescaler.
 *                       This parameter can be any even value between 2 and 65534.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_ChangeClock(SPI0, 2);
 * }
 * \endcode
 */
void SPI_ChangeClock(SPI_TypeDef *SPIx, uint32_t prescaler);

/**
 * \brief   Set SPI Rx sample delay.
 *
 * \param[in] SPIx   Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] delay  This parameter can be 0 to 255.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_SetRxSampleDly(SPI0, 1);
 * }
 * \endcode
 */
void SPI_SetRxSampleDly(SPI_TypeDef *SPIx, uint32_t delay);

#if (SPI_SUPPORT_WRAP_MODE == 1)

/**
 * \brief   Enable or disable the specified SPI wrap mode start transfer.
 *
 * \param[in] SPIx      Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] NewState  New state of the SPIx peripheral.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the specified SPI wrap mode start transfer.
 *                      - DISABLE: Disable the specified SPI wrap mode start transfer.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_WrapModeStartTx(SPI0, ENABLE);
 * }
 * \endcode
 */
void SPI_WrapModeStartTx(SPI_TypeDef *SPIx, FunctionalState NewState);

/**
 * \brief   Enable or disable inverse CS active polarity.
 *
 * \param[in] SPIx      Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] NewState  New state of the SPIx peripheral.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Inverse CS active polarity, which means CS is low active.
 *                      - DISABLE: Not inverse CS active polarity, which means CS is high active.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_InverseCSActivePolarity(SPI0, ENABLE);
 * }
 * \endcode
 */
void SPI_InverseCSActivePolarity(SPI_TypeDef *SPIx, FunctionalState NewState);

/**
 * \brief   Enable or disable driving MOSI low during the idle state.
 *
 * \param[in] SPIx      Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] NewState  New state of the SPIx peripheral.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Drive MOSI low in idle state.
 *                      - DISABLE: Set MOSI to high-impedance (Hi-Z) in idle state.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_DriveMOSILow(SPI0, ENABLE);
 * }
 * \endcode
 */
void SPI_DriveMOSILow(SPI_TypeDef *SPIx, FunctionalState NewState);

/**
 * \brief   Enable or disable the MOSI pull function in the idle state.
 *
 * \param[in] SPIx      Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] NewState  New state of the SPIx peripheral.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: MOSI is pull down in idle state.
 *                      - DISABLE: MOSI is pull none in idle state.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_PullMOSIEn(SPI0, ENABLE);
 * }
 * \endcode
 */
void SPI_PullMOSIEn(SPI_TypeDef *SPIx, FunctionalState NewState);

#endif

/**
 * \brief     Configure the SPI clock divider.
 *
 * \param[in] SPIx      Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] ClockDiv  Specify the SPI clock divider.
 *                      This parameter can refer to \ref SPI_Clock_Divider.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *     RCC_SPIClkDivConfig(SPI0, CLOCK_DIV_1);
 * }
 * \endcode
 */
void SPI_ClkDivConfig(SPI_TypeDef *SPIx, SPIClockDiv_TypeDef ClockDiv);

#if SPI_SUPPORT_CLOCK_SOURCE_CONFIG
/**
 * \brief  Configure the SPI clock.
 *
 * \param[in]  SPIx      Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in]  ClockSrc  Specify the clock source to gates its clock.
 * \param[in]  ClockDiv  Specify the clock divider to gates its clock.
 */
void SPI_ClkConfig(SPI_TypeDef *SPIx, SPIClockSrc_TypeDef ClockSrc,
                   SPIClockDiv_TypeDef ClockDiv);

/**
 * \brief  Get the SPI clock configuration.
 *
 * \param[in] SPIx      Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] ClockSrc  Specify the clock source to gates its clock.
 * \param[in] ClockDiv  Specify the clock divide to gates its clock.
 *
 * \return The status of get clock.
 */
bool SPI_ClkGet(SPI_TypeDef *SPIx, SPIClockSrc_TypeDef *ClockSrc, SPIClockDiv_TypeDef *ClockDiv);
#endif

#if SPI_SUPPORT_CLOCK_SOURCE_SWTICH
/**
 * \brief  SPI clock source switch.
 *
 * \param[in] SPIx         Select the SPI peripheral. Refer to \ref SPI_Declaration.
 * \param[in] ClockSource  SPI clock source to switch.
 *                         This parameter can be one of the following values:
 *                         - SPI_CLOCK_SOURCE_40M: Select SPI clock source of 40MHz.
 *                         - SPI_CLOCK_SOURCE_PLL: Select SPI clock source of PLL.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *     SPI_ClkSourceSwitch(SPI0, SPI_CLOCK_SOURCE_40M);
 * }
 * \endcode
 */
extern void SPI_ClkSourceSwitch(SPI_TypeDef *SPIx, uint16_t ClockSource);
#endif


#if (SPI_SUPPORT_RAP_FUNCTION == 1)

void SPI_RAPModeCmd(SPI_TypeDef *SPIx, FunctionalState NewState);

void SPI_SetTaskCmdNum(SPI_TypeDef *SPIx, uint8_t num);

void SPI_SetTaskWaitNum(SPI_TypeDef *SPIx, uint8_t num);

void SPI_SetTaskTransferNum(SPI_TypeDef *SPIx, uint8_t num);

void SPI_TaskTrigger(SPI_TypeDef *SPIx, uint32_t task);

bool SPI_TaskEventStsCheck(SPI_TypeDef *SPIx, uint32_t te);

void SPI_TaskEventStsClear(SPI_TypeDef *SPIx, uint32_t te);

#endif
/** End of SPI_Exported_Functions
  * \}
  */

/** End of SPI
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /* RTL_SPI_H */


